Revit 2026 API

# ExtrusionAnalyzer Methods

---

The ExtrusionAnalyzer type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CalculateFaceAlignment | Calculates the alignment status of each face of the solid. |
|  | Create | Creates an ExtrusionAnalyzer and computes and stores the Solid's shadow. |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetExtrusionBase | Obtains the face that represents the base contour of the extrusion analysis. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

ExtrusionAnalyzer Class

Autodesk.Revit.DB Namespace